In [22]:
# Import the required libraries and dependencies
import pandas as pd
import datetime as dt
%matplotlib inline

In [23]:
# Read the 5 csv files as DataFrames, with the first date as index
# Name them AAPL, COMP, GOOGL, MSFT and SPX

msft_df = pd.read_csv('Resources/MSFT-5-yrs.csv',
                 index_col="Date",
                 parse_dates=True
                 )

aapl_df = pd.read_csv('Resources/AAPL-5-yrs.csv',
                 index_col="Date",
                 parse_dates=True
                 )

googl_df = pd.read_csv('Resources/GOOGL-5-yrs.csv',
                 index_col="Date",
                 parse_dates=True
                 )

comp_df = pd.read_csv('Resources/COMP-5-yrs.csv',
                 index_col="Date",
                 parse_dates=True
                 )

spx_df = pd.read_csv('Resources/SPX-5-yrs.csv',
                 index_col="Date",
                 parse_dates=True
                 )

In [24]:
# Preview all 5 datasets to ensure that all column names match and that there is no null data
display(msft_df.head(), aapl_df.head(), googl_df.head(), comp_df.head(), spx_df.head())

           Close/Last    Volume     Open     High      Low
Date
2024-10-08    $414.71  19229260  $410.90  $415.66  $408.17
2024-10-07    $409.54  20919760  $416.00  $417.11  $409.00
2024-10-04    $416.06  19190910  $418.24  $419.75  $414.97
2024-10-03    $416.54  13686420  $417.63  $419.55  $414.29
2024-10-02    $417.13  16582260  $422.58  $422.82  $416.71

           Close/Last    Volume     Open      High      Low
Date
2024-10-08    $225.77  31855690  $224.30   $225.98  $223.25
2024-10-07    $221.69  39505350  $224.50   $225.69  $221.33
2024-10-04    $226.80  37345100  $227.90   $228.00  $224.13
2024-10-03    $225.67  34044160  $225.14  $226.805  $223.32
2024-10-02    $226.78  32880610  $225.89   $227.37  $223.02

           Close/Last    Volume     Open      High       Low
Date
2024-10-08    $164.38  23072730  $163.94  $164.725   $162.87
2024-10-07    $162.98  22463140  $167.72   $168.48   $162.75
2024-10-04    $167.06  19093720  $168.06   $168.23   $165.48
2024-10-03    $165.86  15073100  $164.41   $166.64  $163.923
2024-10-02    $165.86  17760180  $166.42   $167.52   $164.73

            Close/Last      Open      High       Low
Date
2024-10-07    17923.90  18080.11  18096.33  17900.04
2024-10-04    18137.85  18130.42  18145.28  17952.30
2024-10-03    17918.48  17859.49  18011.25  17826.42
2024-10-02    17925.12  17867.12  17978.57  17767.79
2024-10-01    17910.36  18154.94  18162.72  17779.77

            Close/Last     Open     High      Low
Date
2024-10-07     5695.94  5737.80  5739.34  5686.85
2024-10-04     5751.07  5737.48  5753.21  5702.83
2024-10-03     5699.94  5698.19  5718.78  5677.37
2024-10-02     5709.54  5698.14  5719.63  5674.00
2024-10-01     5708.75  5757.73  5757.73  5681.28

In [25]:
# Cleanup CSV's and and keep only the closing price and volume
msft_df.info()
aapl_df.info()
googl_df.info()
comp_df.info()
spx_df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1259 entries, 2024-10-08 to 2019-10-08
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Close/Last  1259 non-null   object
 1   Volume      1259 non-null   int64
 2   Open        1259 non-null   object
 3   High        1259 non-null   object
 4   Low         1259 non-null   object
dtypes: int64(1), object(4)
memory usage: 59.0+ KB
<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1259 entries, 2024-10-08 to 2019-10-08
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Close/Last  1259 non-null   object
 1   Volume      1259 non-null   int64
 2   Open        1259 non-null   object
 3   High        1259 non-null   object
 4   Low         1259 non-null   object
dtypes: int64(1), object(4)
memory usage: 59.0+ KB
<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1259 entries, 2024-10-08 to 2019-10-08
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Close/Last  1259 non-null   object
 1   Volume      1259 non-null   int64
 2   Open        1259 non-null   object
 3   High        1259 non-null   object
 4   Low         1259 non-null   object
dtypes: int64(1), object(4)
memory usage: 59.0+ KB
<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1258 entries, 2024-10-07 to 2019-10-08
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Close/Last  1258 non-null   float64
 1   Open        1258 non-null   float64
 2   High        1258 non-null   float64
 3   Low         1258 non-null   float64
dtypes: float64(4)
memory usage: 49.1 KB
<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1258 entries, 2024-10-07 to 2019-10-08
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Close/Last  1258 non-null   float64
 1   Open        1258 non-null   float64
 2   High        1258 non-null   float64
 3   Low         1258 non-null   float64
dtypes: float64(4)
memory usage: 49.1 KB

In [29]:
#Rename Close/Last column to company_close
msft_df = msft_df.rename(columns={'Close/Last': 'msft_close'})
aapl_df = aapl_df.rename(columns={'Close/Last': 'aapl_close'})
googl_df = googl_df.rename(columns={'Close/Last': 'googl_close'})
comp_df = comp_df.rename(columns={'Close/Last': 'comp_close'})
spx_df = spx_df.rename(columns={'Close/Last': 'spx_close'})
#aapl_df.head()
display(msft_df.head(), aapl_df.head(), googl_df.head(), comp_df.head(), spx_df.head())

           msft_close    Volume     Open     High      Low
Date
2024-10-08    $414.71  19229260  $410.90  $415.66  $408.17
2024-10-07    $409.54  20919760  $416.00  $417.11  $409.00
2024-10-04    $416.06  19190910  $418.24  $419.75  $414.97
2024-10-03    $416.54  13686420  $417.63  $419.55  $414.29
2024-10-02    $417.13  16582260  $422.58  $422.82  $416.71

           aapl_close    Volume     Open      High      Low
Date
2024-10-08    $225.77  31855690  $224.30   $225.98  $223.25
2024-10-07    $221.69  39505350  $224.50   $225.69  $221.33
2024-10-04    $226.80  37345100  $227.90   $228.00  $224.13
2024-10-03    $225.67  34044160  $225.14  $226.805  $223.32
2024-10-02    $226.78  32880610  $225.89   $227.37  $223.02

           googl_close    Volume     Open      High       Low
Date
2024-10-08     $164.38  23072730  $163.94  $164.725   $162.87
2024-10-07     $162.98  22463140  $167.72   $168.48   $162.75
2024-10-04     $167.06  19093720  $168.06   $168.23   $165.48
2024-10-03     $165.86  15073100  $164.41   $166.64  $163.923
2024-10-02     $165.86  17760180  $166.42   $167.52   $164.73

            comp_close      Open      High       Low
Date
2024-10-07    17923.90  18080.11  18096.33  17900.04
2024-10-04    18137.85  18130.42  18145.28  17952.30
2024-10-03    17918.48  17859.49  18011.25  17826.42
2024-10-02    17925.12  17867.12  17978.57  17767.79
2024-10-01    17910.36  18154.94  18162.72  17779.77

            spx_close     Open     High      Low
Date
2024-10-07    5695.94  5737.80  5739.34  5686.85
2024-10-04    5751.07  5737.48  5753.21  5702.83
2024-10-03    5699.94  5698.19  5718.78  5677.37
2024-10-02    5709.54  5698.14  5719.63  5674.00
2024-10-01    5708.75  5757.73  5757.73  5681.28

In [32]:
# Merge the Dataframes into one - call it MERGED
merged_df = pd.concat([msft_df['msft_close'], aapl_df['aapl_close'], googl_df['googl_close'], comp_df['comp_close'], spx_df['spx_close']], axis=1).dropna()

In [38]:
#Preview the merged df; look at info
display(merged_df.head(), merged_df.tail(), merged_df.info())

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1258 entries, 2019-10-08 to 2024-10-07
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   msft_close   1258 non-null   object
 1   aapl_close   1258 non-null   object
 2   googl_close  1258 non-null   object
 3   comp_close   1258 non-null   float64
 4   spx_close    1258 non-null   float64
dtypes: float64(2), object(3)
memory usage: 59.0+ KB

           msft_close aapl_close googl_close  comp_close  spx_close
Date
2019-10-08    $135.67     $56.10    $59.5065     7823.78    2893.06
2019-10-09    $138.24   $56.7575      $60.12     7903.74    2919.40
2019-10-10    $139.10   $57.5225    $60.4735     7950.78    2938.13
2019-10-11    $139.68   $59.0525    $60.7855     8057.04    2970.27
2019-10-14    $139.55   $58.9675    $60.8885     8048.65    2966.15

           msft_close aapl_close googl_close  comp_close  spx_close
Date
2024-10-01    $420.69    $226.21     $166.99    17910.36    5708.75
2024-10-02    $417.13    $226.78     $165.86    17925.12    5709.54
2024-10-03    $416.54    $225.67     $165.86    17918.48    5699.94
2024-10-04    $416.06    $226.80     $167.06    18137.85    5751.07
2024-10-07    $409.54    $221.69     $162.98    17923.90    5695.94

None

In [56]:
#Remove dollar signs
merged_df['msft_close'] = merged_df['msft_close'].str.replace('$', '', regex=False)
merged_df['aapl_close'] = merged_df['aapl_close'].str.replace('$', '', regex=False)
merged_df['googl_close'] = merged_df['googl_close'].str.replace('$', '', regex=False)

#Verify conversion to float
merged_df.head()

        Date  msft_close  aapl_close  googl_close  comp_close  spx_close
0 2019-10-08      135.67       56.10        59.51     7823.78    2893.06
1 2019-10-09      138.24       56.76        60.12     7903.74    2919.40
2 2019-10-10      139.10       57.52        60.47     7950.78    2938.13
3 2019-10-11      139.68       59.05        60.79     8057.04    2970.27
4 2019-10-14      139.55       58.97        60.89     8048.65    2966.15

In [58]:
#Make close columns dtype float64 and round to 2 decimal places
merged_df[['msft_close', 'aapl_close', 'googl_close']] = merged_df[['msft_close', 'aapl_close', 'googl_close']].astype(float).round(2)
merged_df.head()

        Date  msft_close  aapl_close  googl_close  comp_close  spx_close
0 2019-10-08      135.67       56.10        59.51     7823.78    2893.06
1 2019-10-09      138.24       56.76        60.12     7903.74    2919.40
2 2019-10-10      139.10       57.52        60.47     7950.78    2938.13
3 2019-10-11      139.68       59.05        60.79     8057.04    2970.27
4 2019-10-14      139.55       58.97        60.89     8048.65    2966.15

In [ ]:
#Marianne - Plot historical trends of the 3 tech stocks, along with calculating mean & standard deviation (see pg 7 of the powerpoint)

In [ ]:
#Pete - Plot correlation of stocks; drill into 2024 performance (see pg 8 of powerpoint)

In [ ]:
#Ethan - Forecast/Predict stock trends of Apple (see pg 9 of powerpoint)

In [ ]:
#Mark - Forecast/Predict stock trends of Microsoft (see pg 9 of powerpoint)

In [ ]:
#Marianne - Forecast/Predict stock trends of Google (see pg 9 of powerpoint)

In [ ]:
#Backburner; Pete - Plot components of highest performing forecast (pg 10 of powerpoint)

In [ ]:
#Steve - Compare these tech stocks to the Nasdaq & S&P 500 indices (pg 11 of powerpoint)